Revit 2016 API
BoundaryConditions.NumCurves Property
Returns the number of curves represent the Boundary Conditions Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetLoops() method instead.")]
public int NumCurves { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use GetLoops() method instead.")> _
Public ReadOnly Property NumCurves As Integer
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use GetLoops() method instead.")]
public:
property int NumCurves {
	int get ();
}
Remarks
For Point Boundary Conditions returns 0, for Line Boundary Conditions returns 1, for Area Boundary Conditions returns value > 0.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace